["Meals will also be available at the bus stop at the following locations outside of city limits:","ROUTE 1:,Golden Plains (11:00 – 11:15 AM),Radar Trailer Court (11:30 – 11:45 AM),Othello Manor (12:00 – 12:15 PM)","ROUTE 2:,Sportsman Trailer Court (11:00 – 11:15 AM),Taggares Park (11:30 – 12:00 PM),Eagle Apartments (12:05 – 12:20 PM)","ROUTE 3:,Soda Street & Juniper Street (11:00 – 11:20 AM),Yellow Camp (1,1:30 – 11:45 AM),Radar Base Housing (12:00 – 12:15 PM)","ROUTE 4:,Weavers Trailer Court (11:00 – 11:15 AM),Summerset West – Drury Ln & Shelly Rd (11:20 – 11:35 AM),Summerset West – Barbara Rd & Thacker Rd (11:40 – 11:55 AM)","Meals are available every day in the cafeteria from 8:30 a.m. to 11:30 a.m. Delivery options may be available; contact the district office if delivery is needed.","Meals will be delivered via school bus to all Finely school bus stops starting Monday, March 23. Meals will be delivered using the district’s standard two-hour delay schedule (meaning two hours later than students would normally board their bus in the morning.)","Visit this site for additional meal pick-up sites via bus route. ","Visit this site for additional meal pick-up sites via bus route. ","Meals are available for pre-order. To order, email meals@entiatschools.org or call 888-5182.","Orchard Middle School,1024 Orchard Ave, Wenatchee","Port Angeles High School-pick up on the Service Rd behind the HS. Entrance to,Service Rd is off Park (on west side of school).,304 E Park Ave, Port Angeles,M-F 11:30am – 12:15pm","Crescent School District will deliver meals to families as needed. To be added to the delivery route, contact 360-928-3311.","The Boys and Girls Club will be delivering meals to the following locations:,Carrie Blake Park,202 N Blake Ave, Sequim,M-F 12-1pm","Meals are available for home delivery. To order, visit the Hockinson School District website.","Meals are available at all Woodland bus stops. Buses will arrive on a three-hour delay to the typical bus schedule.","Curlew School","Beginning March 18th, the Curlew School District will be providing a twice a week meal delivery to designated spots for students whose families have requested meals. For more information contact the school office at 509-779-4931 or email amykjolseth@curlew.wednet.edu.","Keller School,Keller School will be delivering meals to families starting March 23. To be added to the delivery list, contact 509-634-4325.","Orient School,Meals will be delivered along existing bus routes. If you would like to have meals delivered, contact 509-684-6873.","Republic School","Meals will be available to students beginning March 23. To participate, sign up on the school’s website.","Navigator Villas Apartments (Rd. 68),M-F 11:00AM-12:30PM","Stonegate Apartments (Rd. 68),M-F 11:00AM-12:30PM","W. Washington St. & St. 13th Ave,M-F 11:00AM-12:30PM","West B St (Alley between 5th & 6th Avenues),M-F 11:00AM-12:30PM","Meals will be available along regular Meals on Wheels bus routes. Meal deliveries will be made between 10 a.m. and 10:45 a.m. ","North River,TBD.","Meals will be available on regular bus routes. For pick-up times, visit the school district’s website.","North River,Location to be determined.","Meals will also be distributed along Oakville bus routes.","During the extended closure, the Ocosta School District will be serving meals Monday through Friday and during the weekdays of Spring Break. Meals will be brought to their regular bus stops for any child 18 years old and younger. Please view the school district website here and the Facebook page for further updates.","East Hoquiam Store (Blue Store),M-F 10:15AM-10:25AM","Hiddendale Road, Quilcene,M-F 1050AM-11:20AM","Cemetery Road & East Quil Road,M-F 11:45AM-12:15PM","Terminal Park Elementary,1101 D Street SE, Auburn,M-F 8:30am-9:30am AND 11:00-12:30pm,,Washington Elementary,20 E Street NE, Auburn,M-F 8:30am-9:30am AND 11:00-12:30pm","Lake Washington School District students","Pre-order meals available for pick up at six middle schools: Finn Hill, Inglewood, Kamiakin, Redmond, Rose Hill, and Timberline. Visit the school district webpage for more information.","Mercer Island School District students,Pre-order lunch available for pickup at Mercer Island High School and Islander Middle School. Visit the school district webpage for more information.","Northshore School District students,Pre-order meals available for pickup at 33 locations. Visit the school district webpage for more information.","Riverview School District students,Pre-order meals available for pick up at Cherry Valley Elementary and Carnation Elementary. Visit the school district webpage for more information.","Snoqualmie Valley School District students,Starting Wednesday, March 18th meals will be available for Snoqualmie Valley students. Details to come next week.","Vashon Island School District students,Starting Monday, March 16th meals will be available for Vashon Island students. Details to come. Find more information here.","Sites underlined are specific to spring break dates only (April 6th-10th)","Northwest School Sites,Ballard High School,1418 NW 65th St Seattle, WA 98117,M-F 11:00am-1:00pm","Tukwila School District AM Bus Stops,Bus Routes and Schedules","Pre-order meals on this site to participate in grab-and-go at any of the following meal sites. Call (253)-800-6912 if pick-up is not an option and delivery is needed.","Meals will be delivered along regular afternoon bus routes, four hours prior to the regular drop-off time.","Golf Course Fire Station,M&W 9:30AM-9:45AM","Thorp School District will offer meal delivery at regular bus stops. To receive meal deliveries, contact the school district at 509-964-7102.","Meals are to be picked up at 9:00AM – 10:00AM on M-F, excluding spring break, outside the kitchen. To receive meals contact the school district by phone 509-364-3438 or email at toni.troh@glenwoodsd.org.","Lyle School District buses will deliver meals along bus routes on Tuesdays and Thursdays at specified times between 12:00 PM and 1:00 PM. Sign up for meals here and identify pick-up location. here.","Contact school district at 509-538-2522 to request meals for pick up at the school or at the bus stop.","School district staff will place calls to families for enrollment in meals program during closure.","Pick-up at all bus stops at the 2-hour late start pickup time, or pick-up from the following:","Meals can be picked-up along district bus routes following the two hour late start schedule or pick-up from:","Meals can be picked-up along district regular bus routes or call school district at 360-496-5300 for information on pick-up from:","Morton Jr/Sr High School,152 Westlake Ave, Morton","Morton Elementary School,400 W Main Ave, Morton","Meals can be picked-up along district bus routes one hour later than normal bus arrival time. For more information call school district at 360-983-3181.","Meals can be requested for home drop-off or school pick-up by filling out survey here.","Meals can be requested for home drop-off M-F by filling out survey here.","Meals are to be dropped off at bus stop between 9:00AM – 10:00AM on M-F, excluding spring break, or picked up from the following:","Breezeway picnic tables (near big gym),9:00AM","Meals can be requested for delivery by  filling out survey here.","Meals can be requested  for drop-off at specific pick-up location by filling out survey here.","Meals to be picked up from the following locations, or contact Sammie York 360-785-4568 or syork@winlock.wednet.edu.","Allman Rd,M-F 10:00AM-11:00AM","Call school district 509-639-2414 by 8:00AM M-F if you are located outside bus route to request meal delivery, or pick-up from the following:","Almira Lion’s Club Park,M-F 9:30AM-11AM","Meals will be delivered by routine bus route to out of town students following two hour late start schedule. Call the district office at 509-725-1481 for sign-up. In-town students will are to pick their meals at the following:","Meals available for pick-up outside of school 11:00AM-1:00PM, or at home drop-off after 11:00AM.","P.C. Jantz Elementary,M-F 0:00AM-10:00PM","Meals scheduled for drop-off following four routine bus routes Monday through Friday.  Find closest meal distribution stop near you and corresponding times here.","Meals scheduled for drop-off following routine bus routes Monday through Friday.  Find closest meal distribution stop near you and corresponding times here. Students may also pick up meals from the following:","Meals delivered by bus route can be requested by calling 509-689-2581, 509-689-3440, or 509-689-3418. Students can pick up meals from the following:","Meals will be delivered two hours later than normal morning pick-up time. Students can pick up meals from the following:","Tillman’s (Elmer City),M-F 12:00PM-1:00PM","White Buffalo,11:30AM-12:30PM","New HUD,11:30AM-12:30PM","Old HUD,11:30AM-12:30PM","City Park,11:30AM-12:30PM","Meals can be requested for delivery to bus stop or pick up from school at 10:00AM. Please email food@pateros.org, call 509-923-2343 x 2, call or 509-923-27-51 x 4 for information and sign-up.","Meals will be delivered to all school bus stops with normal afternoon routes except Janis bus route will be one hour later. Students can pick up meals from the following:","Meal must be ordered by phone prior to 9:00AM on day of the delivery. Please call (360) 484-7121 or (360) 777-7127 to place order. Students can pick up meals from the following:","Bay Center Boat Launch,11:20AM","Assembly of God Church,11:05AM","Meals for bus stop delivery M-F and more information can be requested by emailing district.secretary@oceanbeachschools.org.","Meals will be delivered along bus stop routes. To locate closest bus route please visit here.","Meals will be delivered via bus at pre-arranged time to students out of town. Meals for students in town can be picked up at the school between 8:00AM-9:00AM. Please contact school district if you have not been contacted by the school.","Fife School District Bus Stops,Meals delivered to Fife School District bus stops 2 hours later than regular AM pickup.","Monterra Apartments,416 111th St Ct E, Tacoma,M-F 11:00am-1:00pm,,Parkwood Apartments,14209 C St S, Tacoma,M-F 11:00am-1:00pm","Sienna Park Apartments ,10710 17th Ave S, Tacoma,M-F 11:00am-1:00pm,,Summit Apartments,11016 Waller Rd E, Tacoma,M-F 11:00am-1:00pm","Tacoma Public Schools Students can pick up meals from the following and can reference bus routes for further specific stops and times here:","Truman Middle School,5801 N 35th St, Tacoma,M-F 10:00am-12:00pm,,Wainwright Middle School,130 Alameda Ave, Fircrest,M-F 10:00am-12:00pm","Meals will be provided to students through delivery. To enroll, fill out the survey here.","Meals will be given to students through site pick-up. To enroll, fill out the survey here.","Fidalgo (staff parking lot),M-F 11:00AM-12:00PM","Meals should be requested by calling 360-428-6262. Students can pick up meals at the following locations:","Cascade Commons,M-F 9:00AM-12:00PM","Gateway Heights/Sauk Mtn. View Estates Neighborhoods 11-11:30 a.m. (Portabello Avenue: near Gateway Heights sign/rocks, Sedro-Woolley),M-F 11:00AM-11:30AM","Feather Lane & Aerie Lane,M-F 11:00AM-11:30AM","Clear Lake Covenant Church,12605 Hwy 9, Clear Lake,M-F11:00AM-11:30AM,Nookachamps Hill Drive (Pull off on Nookachamps Hill Dr. Closest point would be Hwy 9 & Nookachamp Hills Drive),M-F 11:00AM-11:30AM","Big Lake Elementary School,M-F 11:45AM-12:15PM","Meals can be requested for drop-off at routine afternoon bus stops. Email awarren@skamania.k12.wa.us for more information.","Lunches will be available on Thursdays for families. Contact the school or go into the school on Tuesdays or Thursdays for additional service. Visit Index School District for more information. ","Meals will be delivered to designated bus stops between M-F 9:00AM-10:00AM. More information in English can be found here. More information found in Spanish can be found here. Unclaimed meals can be picked up at the following sites: ","Faith Lutheran Church,1424 172nd St NE, Marysville","Reclamation Church,907 Lakewood Rd, Arlington","Jake’s House,18824 Smokey Point Blvd Suite 105, Arlington","Smokey Point Community Church,17721 Smokey Point Blvd, Arlington","Pre-order meals for each day by filling out form here online or by calling (360) 804-2525. Pre-orders will close at 8:00 AM each day.","Rambo Rd. & Deno Rd.,M-F 9:17AM-9:20AM","Tyler Store,M-F 9:35AM-9:50AM","Spokane St & 4th, Four Lakes,M-F 10:05AM-10:15AM","Cedar Village,M-F 9:05AM-9:15AM ","Meals will be delivered by bus for students in remote locations. Find the sign-up here.","Dalton and Owens,M-F 11:00AM-12:00PM ","Dalton and Montgomery,M-F 11:00AM-12:00PM ","Williams Valley and Price ,M-F 11:00AM-11:25PM ","Swenson and Bittrich Antler Rd.,M-F 11:30AM-12:00PM ","Use form here to request meals. The school district will be in contact with more information. ","Use district website here for updates.","Meals will be delivered using routine bus stops between 11:00AM-1:00PM as well as the following locations. Use the link here for more information.","Meals will be delivered to students using routine bus routes, following late start schedule or at the following listed location. Call district office at (509) 685-6800, extension 0 to request.","The district will be distributing grab and go meals from the school Monday through Friday, 8:30 AM to 12:00 PM. Enter through the main entrance and check in at the office. Please check the district website to learn more information. ","The district is planning for food delivery via busses starting on March 23rd, additional information to follow, check Colville School District website to learn more.  ","No information is given at this time please check out Kettle Falls School District No. 212 website to see any updates or to communicate with the school district.  ","To request meals call (509) 937-2791. ","Meals will be delivered M-F 9:00AM-12:00PM. Contact twhite@griffinschool.us for information.","1209 Fern Street SW (Fern Street near Fern Ridge Place SW),M-F 11:00AM-1:00PM","515 Courtside St SW, Olympia (Courtside Street near 5th Ave; off of Capital Mall Drive SW),M-F 11:00AM-1:00PM","Tenino Food Bank Meals for All,Tu 9:00AM-11:00AM and Th 4:00PM-6:00PM","Bucoda Food Bank for All,Tu 1:00PM-3:00PM and 11:00AM-1:00PM","Meals can be requested for pick up. Please call 360-795-3261 to request.","Meals will be distributed from 8:30AM-9:30AM in Prescott and 9:30AM-10:30AM at Vista.","Meals can be picked up at the following locations. Other arrangements can be made for delivery or pick up by calling district office at 337-6301. ","202 Harmon St.,M-F 9:00AM-9:15AM","705 Maple St.,M-F 9:20AM-9:35AM","High School Parking Lot,M-F 10:00AM-10:15AM","900 Caroline St (side of football field),M-F 10:20AM-10:35AM","Catholic Church Parking Lot,M-F 11AM-11:15AM","Meals will be delivered along bus routes. Reference route maps below for stops and times:","Nutrition Delivery Route 1,https://5il.co/dv84","Nutrition Delivery Route 2,https://5il.co/dv85","Nutrition Delivery Route 3,https://5il.co/dv86","Nutrition Delivery Route 4,https://5il.co/dv87","Nutrition Delivery Route 5,https://5il.co/dv88","Nutrition Delivery Route 6,https://5il.co/dv89","Meals will be delivered to students not within walking distance or are without transportation, to pick up location. Please call 360-318-2172 between 8:30AM-9:30AM to request.","Mobile Lane,11:00AM-11:15AM","Pacific Rim Apartments,11:00AM-11:30AM","Reverse the Baker Bus,Meals delivered through morning routine elementary bus routes Tuesday and Friday between 10:00AM-12:00PM","Catholic Church parking lot,M-F Shortly before 8:00AM- 8:15AM","Lookout Park (Thorn Hill),M-F Shortly before 8:00AM- 8:15AM","Hauser Heights,M-F Shortly before 8:00AM- 8:15AM","10th Street,M-F Shortly before 8:00AM- 8:15AM","Meals will be distributed at the following pick-up locations or through delivery by bus. Please visit district website to identify time and stop.","Meals will be delivered between 9:00AM-12:00PM, to provided address given before March 18th @ 12:00PM. ","Bulk distribution will be on April 14th and 21st for five days of meals at the following locations.","Meals can be picked up at the following schools or along bus routes at the following times.","Eberle PlaceButternut & Briar Ct.,M-F 12:00PM-1:00PM","Larson & Beacon,M-F 12:00PM-1:00PM","Arteaga Circle,M-F 12:00PM-1:00PM","Water Tower Park (Velma & King St.),M-F 12:00PM-1:00PM","Hillcrest & Vista,M-F 12:00PM-1:00PM","Eastside Park (Third & Cedar),M-F 12:00PM-1:00PM","Grandridge Mobile Home Park,M-F 12:00PM-1:00PM","ABC Daycare – 620 Grandridge Rd.,M-F 12:00PM-1:00PM","Munson Lane (between Wolfe & Division),M-F 12:00PM-1:00PM","Broadview & Nicka,M-F 12:00PM-1:00PM","Nicka & Division,M-F 12:00PM-1:00PM","Pettyville,M-F 12:00PM-1:00PM","Vineyard Apartment on Nicka,M-F 12:00PM-1:00PM","Carriage Square Court,M-F 12:00PM-1:00PM","Pleasant & Ella Loop,M-F 12:00PM-1:00PM","Lamplighter,M-F 12:00PM-1:00PM","DeAngela Ct.,M-F 12:00PM-1:00PM","Stir Crazy,M-F 12:00PM-1:00PM","Wine Country & Vial,M-F 12:00PM-1:00PM","Birch (between Adam & Washington),M-F 12:00PM-1:00PM","Washington & N. Elm,M-F 12:00PM-1:00PM","Pick up will be April 13th from either 10:00AM-12:00PM or 4:00PM-6:00PM at the bus behind Roosevelt and Granger Middle Schools. Call 854-1614 if transportation if you are inhibited from participating in meal pick-up and need to discuss delivery options. ","Park Bus Stop (Outside of city limits at normal pick-up/drop-off bus locations),M-F 10:30AM-12:00PM","Conrad Rd near Longmire Ln (Wenas site),M-F 11:00AM-12:00PM","Meals can be picked up at the listed locations or along designated bus route found on this site.","Meals can be picked up at the listed locations or along designated van route found at this site. ","Buena and Willow Tree,M-F 10:00AM-12:00PM","Beginning April 14th Union Gap will be providing bulk meal pick-up every Tuesday at the school. Families will be contacted with reminders the day before.","For updated information on meal site pick-up locations and times please visit this site. Meals will be distributed in bulk.","Meals are now distributed in bulk every Thursday."]